//#include <stdio.h>
#include <conio.h>
#include <ctype.h>
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include "IsAlphaPlus.h"

/*
Custom characters:
Ȧ ȧ Ǎ ǎ Ă ă Ā ā Ą ą Ⱥ Ấ ấ Ầ ầ Ắ ắ Ằ ằ Ǡ ǡ Ǻ ǻ Ǟ ǟ Ẫ ẫ Ẵ ẵ Ả ả Ȁ ȁ Ȃ ȃ Ẩ ẩ Ẳ ẳ Ạ ạ Ḁ ḁ Ậ ậ ẚ Ặ ặ Ǽ ǽ Ǣ ǣ Ḃ ḃ ƀ Ƀ Ɓ Ḅ ḅ Ḇ ḇ Ƃ ƃ Ƅ ƅ Ċ ċ Ć ć Ĉ ĉ Ȼ ȼ Ḉ ḉ Ƈ ƈ Ɔ Č č Ḋ ḋ Ď ď Ḑ ḑ Đ đ Ƌ ƌ Ɗ Ḍ ḍ Ḓ ḓ Ḏ ḏ ƍ ȸ Ǳ ǲ ǳ Ǆ ǅ ǆ Ɖ ȡ ẟ Ė ė Ě ě Ĕ ĕ Ē ē Ẽ ẽ Ę ę Ȩ ȩ Ɇ ɇ Ế ế Ề ề Ḗ ḗ Ḕ ḕ Ễ ễ Ḝ ḝ Ẻ ẻ Ȅ ȅ Ȇ ȇ Ể ể Ẹ ẹ Ḙ ḙ Ḛ ḛ Ệ ệ Ǝ ǝ Ə Ɛ Ȝ ȝ Ḟ ḟ Ƒ ƒ Ġ ġ Ǵ ǵ Ĝ ĝ Ǧ ǧ Ğ ğ Ḡ ḡ Ģ ģ Ǥ ǥ Ɠ Ɣ Ḣ ḣ Ĥ ĥ Ḧ ḧ Ȟ ȟ Ḩ ḩ Ħ ħ Ḥ ḥ Ḫ ḫ ẖ ƕ Ƕ İ ı Ǐ ǐ Ĭ ĭ Ī ī Ĩ ĩ Į į Ɨ Ḯ ḯ Ỉ ỉ Ȉ ȉ Ȋ ȋ Ị ị Ḭ ḭ Ɩ Ĳ ĳ ȷ Ĵ ĵ ǰ Ɉ ɉ ĸ Ḱ ḱ Ǩ ǩ Ķ ķ Ƙ ƙ Ḳ ḳ Ḵ ḵ Ŀ ŀ Ĺ ĺ Ľ ľ Ļ ļ ƚ Ƚ Ł ł ƛ Ḷ ḷ Ḽ ḽ Ḻ ḻ Ḹ ḹ Ǉ ǈ ǉ Ỻ ỻ ȴ Ḿ ḿ Ṁ ṁ Ṃ ṃ Ɯ Ń ń Ǹ ǹ Ṅ ṅ Ň ň Ņ ņ Ɲ ŉ ƞ Ƞ Ṇ ṇ Ṋ ṋ Ṉ ṉ Ǌ ǋ ǌ ȵ Ŋ ŋ Ȯ ȯ Ǒ ǒ Ŏ ŏ Ō ō Ǫ ǫ Ő ő Ố ố Ồ ồ Ɵ Ṓ ṓ Ṑ ṑ Ȱ ȱ Ṍ ṍ Ȫ ȫ Ỗ ỗ Ṏ ṏ Ǿ ǿ Ȭ ȭ Ǭ ǭ Ỏ ỏ Ȍ ȍ Ȏ ȏ Ơ ơ Ổ ổ Ọ ọ Ớ ớ Ờ ờ Ỡ ỡ Ộ ộ Ƣ ƣ Ở ở Ợ ợ Œ œ Ȣ ȣ Ṕ ṕ Ṗ ṗ Ƥ ƥ Ɋ ɋ ȹ Ʀ Ŕ ŕ Ṙ ṙ Ŗ ŗ Ɍ ɍ Ȑ ȑ Ȓ ȓ Ṛ ṛ Ṟ ṟ Ṝ ṝ Ř ř Ś ś Ṡ ṡ Ŝ ŝ Ş ş Ṥ ṥ Ṧ ṧ Ṣ ṣ Ș ș ȿ Ṩ ṩ Ʃ Ƨ ƨ ƪ ẞ ſ ẛ ẜ ẝ Š š Ṫ ṫ ẗ Ť ť Ţ ţ Ƭ ƭ ƫ Ṭ ṭ Ʈ Ț ț Ṱ ṱ Ṯ ṯ Ⱦ ȶ Ŧ ŧ Ǔ ǔ Ŭ ŭ Ū ū Ũ ũ Ů ů Ų ų Ű ű Ʉ Ǘ ǘ Ǜ ǜ Ǚ ǚ Ṹ ṹ Ǖ ǖ Ṻ ṻ Ủ ủ Ȕ ȕ Ȗ ȗ Ư ư Ụ ụ Ṳ ṳ Ứ ứ Ừ ừ Ṷ ṷ Ṵ ṵ Ữ ữ Ʊ Ử ử Ự ự Ṽ ṽ Ṿ ṿ Ʋ Ʌ Ỽ ỽ Ẃ ẃ Ẁ ẁ Ẇ ẇ Ŵ ŵ Ẅ ẅ ẘ Ẉ ẉ ƿ Ƿ Ẋ ẋ Ẍ ẍ Ÿ Ỳ ỳ Ẏ ẏ Ŷ ŷ Ȳ ȳ Ỹ ỹ ẙ Ɏ ɏ Ỷ ỷ Ƴ ƴ Ỵ ỵ Ỿ ỿ Ż ż Ź ź Ẑ ẑ Ƶ ƶ Ȥ ȥ Ẓ ẓ ɀ Ẕ ẕ Ʒ Ǯ ǯ Ƹ ƹ ƺ Ž ž ƾ Ɂ ɂ 
*/
char standardLetters[] = {'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z'};
 char customLetters[] = { 'ý','á','í','é','ú','Ý','Á','Í','É','Ú','Ȧ','ȧ','Ǎ','ǎ','Ă','ă','Ā','ā','Ą','ą','Ⱥ','Ấ','ấ','Ầ','ầ','Ắ','ắ','Ằ','ằ','Ǡ','ǡ','Ǻ','ǻ','Ǟ','ǟ','Ẫ','ẫ','Ẵ','ẵ','Ả','ả','Ȁ','ȁ','Ȃ','ȃ','Ẩ','ẩ','Ẳ','ẳ','Ạ','ạ','Ḁ','ḁ','Ậ','ậ','ẚ','Ặ','ặ','Ǽ','ǽ','Ǣ','ǣ','Ḃ','ḃ','ƀ','Ƀ','Ɓ','Ḅ','ḅ','Ḇ','ḇ','Ƃ','ƃ','Ƅ','ƅ','Ċ','ċ','Ć','ć','Ĉ','ĉ','Ȼ','ȼ','Ḉ','ḉ','Ƈ','ƈ','Ɔ','Č','č','Ḋ','ḋ','Ď','ď','Ḑ','ḑ','Đ','đ','Ƌ','ƌ','Ɗ','Ḍ','ḍ','Ḓ','ḓ','Ḏ','ḏ','ƍ','ȸ','Ǳ','ǲ','ǳ','Ǆ','ǅ','ǆ','Ɖ','ȡ','ẟ','Ė','ė','Ě','ě','Ĕ','ĕ','Ē','ē','Ẽ','ẽ','Ę','ę','Ȩ','ȩ','Ɇ','ɇ','Ế','ế','Ề','ề','Ḗ','ḗ','Ḕ','ḕ','Ễ','ễ','Ḝ','ḝ','Ẻ','ẻ','Ȅ','ȅ','Ȇ','ȇ','Ể','ể','Ẹ','ẹ','Ḙ','ḙ','Ḛ','ḛ','Ệ','ệ','Ǝ','ǝ','Ə','Ɛ','Ȝ','ȝ','Ḟ','ḟ','Ƒ','ƒ','Ġ','ġ','Ǵ','ǵ','Ĝ','ĝ','Ǧ','ǧ','Ğ','ğ','Ḡ','ḡ','Ģ','ģ','Ǥ','ǥ','Ɠ','Ɣ','Ḣ','ḣ','Ĥ','ĥ','Ḧ','ḧ','Ȟ','ȟ','Ḩ','ḩ','Ħ','ħ','Ḥ','ḥ','Ḫ','ḫ','ẖ','ƕ','Ƕ','İ','ı','Ǐ','ǐ','Ĭ','ĭ','Ī','ī','Ĩ','ĩ','Į','į','Ɨ','Ḯ','ḯ','Ỉ','ỉ','Ȉ','ȉ','Ȋ','ȋ','Ị','ị','Ḭ','ḭ','Ɩ','Ĳ','ĳ','ȷ','Ĵ','ĵ','ǰ','Ɉ','ɉ','ĸ','Ḱ','ḱ','Ǩ','ǩ','Ķ','ķ','Ƙ','ƙ','Ḳ','ḳ','Ḵ','ḵ','Ŀ','ŀ','Ĺ','ĺ','Ľ','ľ','Ļ','ļ','ƚ','Ƚ','Ł','ł','ƛ','Ḷ','ḷ','Ḽ','ḽ','Ḻ','ḻ','Ḹ','ḹ','Ǉ','ǈ','ǉ','Ỻ','ỻ','ȴ','Ḿ','ḿ','Ṁ','ṁ','Ṃ','ṃ','Ɯ','Ń','ń','Ǹ','ǹ','Ṅ','ṅ','Ň','ň','Ņ','ņ','Ɲ','ŉ','ƞ','Ƞ','Ṇ','ṇ','Ṋ','ṋ','Ṉ','ṉ','Ǌ','ǋ','ǌ','ȵ','Ŋ','ŋ','Ȯ','ȯ','Ǒ','ǒ','Ŏ','ŏ','Ō','ō','Ǫ','ǫ','Ő','ő','Ố','ố','Ồ','ồ','Ɵ','Ṓ','ṓ','Ṑ','ṑ','Ȱ','ȱ','Ṍ','ṍ','Ȫ','ȫ','Ỗ','ỗ','Ṏ','ṏ','Ǿ','ǿ','Ȭ','ȭ','Ǭ','ǭ','Ỏ','ỏ','Ȍ','ȍ','Ȏ','ȏ','Ơ','ơ','Ổ','ổ','Ọ','ọ','Ớ','ớ','Ờ','ờ','Ỡ','ỡ','Ộ','ộ','Ƣ','ƣ','Ở','ở','Ợ','ợ','Œ','œ','Ȣ','ȣ','Ṕ','ṕ','Ṗ','ṗ','Ƥ','ƥ','Ɋ','ɋ','ȹ','Ʀ','Ŕ','ŕ','Ṙ','ṙ','Ŗ','ŗ','Ɍ','ɍ','Ȑ','ȑ','Ȓ','ȓ','Ṛ','ṛ','Ṟ','ṟ','Ṝ','ṝ','Ř','ř','Ś','ś','Ṡ','ṡ','Ŝ','ŝ','Ş','ş','Ṥ','ṥ','Ṧ','ṧ','Ṣ','ṣ','Ș','ș','ȿ','Ṩ','ṩ','Ʃ','Ƨ','ƨ','ƪ','ẞ','ſ','ẛ','ẜ','ẝ','Š','š','Ṫ','ṫ','ẗ','Ť','ť','Ţ','ţ','Ƭ','ƭ','ƫ','Ṭ','ṭ','Ʈ','Ț','ț','Ṱ','ṱ','Ṯ','ṯ','Ⱦ','ȶ','Ŧ','ŧ','Ǔ','ǔ','Ŭ','ŭ','Ū','ū','Ũ','ũ','Ů','ů','Ų','ų','Ű','ű','Ʉ','Ǘ','ǘ','Ǜ','ǜ','Ǚ','ǚ','Ṹ','ṹ','Ǖ','ǖ','Ṻ','ṻ','Ủ','ủ','Ȕ','ȕ','Ȗ','ȗ','Ư','ư','Ụ','ụ','Ṳ','ṳ','Ứ','ứ','Ừ','ừ','Ṷ','ṷ','Ṵ','ṵ','Ữ','ữ','Ʊ','Ử','ử','Ự','ự','Ṽ','ṽ','Ṿ','ṿ','Ʋ','Ʌ','Ỽ','ỽ','Ẃ','ẃ','Ẁ','ẁ','Ẇ','ẇ','Ŵ','ŵ','Ẅ','ẅ','ẘ','Ẉ','ẉ','ƿ','Ƿ','Ẋ','ẋ','Ẍ','ẍ','Ÿ','Ỳ','ỳ','Ẏ','ẏ','Ŷ','ŷ','Ȳ','ȳ','Ỹ','ỹ','ẙ','Ɏ','ɏ','Ỷ','ỷ','Ƴ','ƴ','Ỵ','ỵ','Ỿ','ỿ','Ż','ż','Ź','ź','Ẑ','ẑ','Ƶ','ƶ','Ȥ','ȥ','Ẓ','ẓ','ɀ','Ẕ','ẕ','Ʒ','Ǯ','ǯ','Ƹ','ƹ','ƺ','Ž','ž','ƾ','Ɂ','ɂ'};
//check if str[0] is a custom letter defined above, if so return 1, else return 0
int IsAlphaPlus(char str)
{


	
    for (int i = 0; i < 52-1; i++)
    {
		//printf("Now analysing: %c\n", str);
        if (str == standardLetters[i])
        {
            return 1;
        }
    }
    
    for (int i = 0; i < 595 - 1; i++)
    {
        if (str == customLetters[i])
        {
            return 1;
        }

    }
    

    return 0;
    
}